Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If a window of a specific app is active when you press the hotkey.
ja: ホットキーを押したときに、特定のアプリのウィンドウがアクティブになっている場合。

source: If a wrapper object's VarType includes the VT_BYREF (0x4000) flag, empty brackets [] can be used to read or write the referenced value.
ja: もし、ラッパーオブジェクトの VarTypeはVT_BYREF(0x4000)フラグを含むので、空カッコ[]で参照値の読み書きが可能です。

source: If a wrapper object's VarType is VT_UNKNOWN (13) or VT_DISPATCH (9) and the wrapped pointer is null (0), the Ptr property can be used to retrieve the current null value or to assign a pointer to the wrapper object.
ja: もし、ラッパーオブジェクトの VarTypeがVT_UNKNOWN（13）またはVT_DISPATCH（9）で、ラップされたポインタがヌル（0）の場合、Ptrプロパティを使って現在のヌル値を取得するか、ラッパーオブジェクトへのポインタを割り当てることができる。

source: If a wrapper object's VarType is VT_UNKNOWN (13) or includes the VT_BYREF (0x4000) flag or VT_ARRAY (0x2000) flag, the Ptr property can be used to retrieve the address of the object, typed variable or SafeArray.
ja: もし、ラッパーオブジェクトの VarTypeが VT_UNKNOWN (13) であるか、VT_BYREF (0x4000) フラグまたは VT_ARRAY (0x2000) フラグを含む場合、Ptrプロパティを使用してオブジェクト、型付き変数または SafeArray のアドレスを取得することができる。

source: If all components are omitted, a single left click is performed at the mouse cursor's current position.
ja: 全ての要素を省略すると、カーソルの現在地で左クリックします。

source: If all matching processes are closed, zero is returned.
ja: 一致するすべてのプロセスが終了している場合は、0が返されます。

source: If all modifiers were logically down (pressed), the full string is:
ja: すべてのモディファイアが論理的にダウン（押された）した場合、完全な文字列は次のようになります：

source: If all parameters are omitted, the width of every column is adjusted to fit the contents of the rows.
ja: すべてのパラメータが省略された場合、各列の幅は行の内容に合うように調整されます。

source: If all six attempts fail, WinActivate automatically sends {Alt 2} as a workaround for possible restrictions enforced by the operating system, and then makes a seventh attempt.
ja: 6回の試行がすべて失敗した場合、WinActivateは自動的に{Alt 2}を送信し、オペレーティングシステムによる制限を回避します。

source: If all these fail, it may not be possible for AHK to work with your game.
ja: これらすべてがダメな場合、AHKがあなたのゲームに取り組むことは不可能かもしれません。

source: If an Else owns more than one line, those lines must be enclosed in braces (to create a block).
ja: Elseが複数の行を所有する場合、それらの行を中括弧で囲む（ブロックを作る）必要があります。

source: If an If owns more than one line, those lines must be enclosed in braces (to create a block).
ja: 複数の行を所有する場合は、それらの行を中括弧で囲む必要があります（ブロックを作成するため）。

source: If an ANSI or UTF-8 string will be written into the buffer with StrPut, do not use StrLen to determine the buffer size, as the ANSI or UTF-8 length may differ from the native (UTF-16) length.
ja: StrPutでANSIまたはUTF-8の文字列をバッファに書き込む場合、ANSIまたはUTF-8の長さがネイティブ（UTF-16）の長さと異なる場合があるので、バッファのサイズを決めるのにStrLenを使用しないでください。

source: If an Edit control is auto-detected as a single line, it defaults to having ES_AUTOHSCROLL.
ja: 編集コントロールが1行として自動検出された場合、デフォルトでES_AUTOHSCROLLが設定されます。

source: If an Edit control is auto-detected as multi-line due to its starting contents containing multiple lines, its height being taller than 1 row, or its row-count having been explicitly specified as greater than 1, the following styles will be applied by default:
ja: 編集コントロールが、その開始コンテンツが複数行を含むか、その高さが1行より高いか、その行数が明示的に1より大きく指定されているために複数行として自動検出された場合、デフォルトで以下のスタイルが適用されます：

source: If an Edit control is auto-detected as multi-line due to its starting contents containing multiple lines, its height being taller than 1 row, or its row-count having been explicitly specified as greater than 1, the following styles will be applied by default: WS_VSCROLL, ES_WANTRETURN, and ES_AUTOVSCROLL.
ja: 編集コントロールが、その開始コンテンツが複数行を含むか、その高さが1行より高いか、その行数が明示的に1より大きく指定されているために複数行として自動検出された場合、デフォルトで以下のスタイルが適用されます：WS_VSCROLL、ES_WANTRETURN、ES_AUTOVSCROLL。

source: If an Input suppresses a given keyboard event, it is passed no further down the stack.
ja: 入力が与えられたキーボードイベントを抑制する場合、そのイベントはそれ以上スタック下に渡されません。

source: If an InputHook detects a key-up without having detected key-down, it is considered non-text.
ja: InputHookがキーダウンを検出せずにキーアップを検出した場合、非テキストとみなされます。

source: If an OnExit function returns a non-zero integer, the script does not terminate; instead, the current thread exits as if Exit was called.
ja: OnExit関数が0以外の整数を返した場合、スクリプトは終了せず、代わりにExitが呼ばれたかのように現在のスレッドが終了します。

source: If an absolute path isn't specified, DllFile is assumed to be in the system's PATH or A_WorkingDir.
ja: 絶対パスが指定されない場合、DllFileはシステムのPATHまたはA_WorkingDirにあるとみなされます。

source: If an assignment is used as the input for some other operator, its value is the variable itself.
ja: 代入が他の演算子の入力として使われる場合、その値は変数そのものとなる。

source: If an asterisk is present but the extension is omitted, the source file's extension is used.
ja: アスタリスクがあっても拡張子が省略された場合は、ソースファイルの拡張子が使用されます。

source: If an event has more parameters than are declared by the callback, they will simply be ignored (unless the callback is variadic).
ja: イベントにコールバックが宣言した以上のパラメータがある場合、それらは単に無視されます（コールバックがvariadicでない限り）。

source: If an event is raised before a previous thread started by that event finishes, it is usually discarded.
ja: そのイベントによって開始された前のスレッドが終了する前にイベントが発生した場合、通常、そのイベントは破棄されます。

source: If an exception or runtime error is thrown while __Delete is executing and is not handled within __Delete, it acts as though __Delete was called from a new thread.
ja: Deleteの実行中に例外または実行時エラーがスローされ、__Delete内で処理されない場合、__Deleteは新しいスレッドから呼び出されたかのように動作します。

source: If an incoming parameter is intended by its caller to be a string, what it actually receives is the address of the string.
ja: 入力されるパラメータが、呼び出し元によって文字列であることが意図されている場合、実際に受け取るのは文字列のアドレスです。

source: If an incoming parameter is intended to be a signed integer, any negative numbers can be revealed by following either of the following examples:
ja: 入力されるパラメータが符号付き整数であることを意図している場合、以下の例のいずれかに従って、負の数を明らかにすることができます。

source: If an incoming parameter is the address of a structure, the individual members may be extracted by following the steps at DllCall structures.
ja: 入力されたパラメータが構造体のアドレスである場合、DllCall構造体の手順に従って、個々のメンバーを抽出することができます。

source: If an inner file loop is enclosed by an outer file loop, the innermost loop's file will take precedence:
ja: 内側のファイルループが外側のファイルループで囲まれている場合、最も内側のループのファイルが優先されます：

source: If an inner file-loop is enclosed by an outer file-loop, the innermost loop's file will take precedence:
ja: 内側のファイルループが外側のファイルループで囲まれている場合、最も内側のループのファイルが優先されます：

source: If an inner file-reading loop is enclosed by an outer file-reading loop, the innermost loop's file-line will take precedence.
ja: 内側のファイル読み込みループが外側のファイル読み込みループに囲まれている場合、一番内側のループのファイル行が優先されます。

source: If an inner loop is enclosed by an outer loop, the inner loop takes precedence.
ja: ループがループで囲まれているときは、内側のループが優先されます。

source: If an inner parsing loop is enclosed by an outer parsing loop, the innermost loop's field will take precedence.
ja: 内側の解析ループが外側の解析ループに囲まれている場合、最も内側のループのフィールドが優先されます。

source: If an inner registry loop is enclosed by an outer registry loop, the innermost loop's registry item will take precedence:
ja: 内側のレジストリループが外側のレジストリループで囲まれている場合、最も内側のループのレジストリ項目が優先されます：

source: If an inner registry-loop is enclosed by an outer registry-loop, the innermost loop's registry item will take precedence:
ja: 内側のレジストリループが外側のレジストリループで囲まれている場合、最も内側のループのレジストリ項目が優先されます：

source: If an integer constant in an expression is outside this range, only the low 64 bits are used (the value is truncated).
ja: 式中の整数定数がこの範囲外にある場合、下位64ビットのみが使用される（値は切り捨てられる）。

source: If an integer is too large to fit in the specified Type, its most significant bytes are ignored; e.g. NumPut("Char", 257, buf) would store the number 1.
ja: 整数が大きすぎて指定したTypeに収まらない場合、その最上位バイトは無視されます。例えば、NumPut("Char", 257, buf)は数値1を格納する。

source: If an invalid User, Password, and/or Domain is specified, Run and RunWait will display an error message explaining the problem (unless this error is caught by a Try/Catch statement).
ja: 無効なUser、Password、Domainが指定された場合、RunおよびRunWaitは問題を説明するエラーメッセージを表示します（このエラーがTry/Catch文によって捕捉される場合を除きます）。

source: If an invalid User, Password, or Domain is specified, Run and RunWait will display an error message explaining the problem (unless this error is caught by a Try/Catch statement).
ja: 無効なUser、Password、Domainが指定された場合、RunおよびRunWaitは問題を説明するエラーメッセージを表示します（このエラーがTry/Catch文によって捕捉される場合を除きます）。

source: If an item has no backslash, the entire item is used as the substring.
ja: 項目にバックスラッシュがない場合は、項目全体が部分文字列として使われる。

source: If an object is passed to a Ptr parameter, the value of the object's Ptr property is used.
ja: Ptrパラメータにオブジェクトが渡された場合、そのオブジェクトのPtrプロパティの値が使用されます。

source: If an object is passed to a Ptr* parameter, the value of the object's Ptr property is retrieved before the call and the address of a temporary variable containing this value is passed to the function.
ja: Ptr*パラメータにオブジェクトが渡された場合、呼び出し前にオブジェクトのPtrプロパティの値が取得され、この値を含む一時変数のアドレスが関数に渡されます。

source: If an object or string is specified, Bytes is optional and defaults to the size of the buffer or string.
ja: オブジェクトまたは文字列が指定された場合、Bytesはオプションであり、デフォルトはバッファまたは文字列のサイズです。

source: If an opening or closing parenthesis appears to the right of the initial opening parenthesis (except as a parameter of the Join option), the line is reinterpreted as an expression instead of the beginning of a continuation section.
ja: 最初の開始括弧の右側に開始括弧または閉じ括弧がある場合（Joinオプションのパラメータを除く）、その行は継続セクションの開始ではなく、式として再解釈される。

source: If an unsigned 32-bit value is intended, the result can be truncated with result & 0xffffffff.
ja: 符号なし32ビット値が意図されている場合、result & 0xffffffffで結果を切り捨てることができる。

source: If another thread changes the contents of any variable(s) that were used for this function's parameters, the function will not see the change -- it will continue to use the title and text that were originally present in the variables when the function first started waiting.
ja: 他のスレッドが、この関数のパラメータに使われていた変数の内容を変更しても、この関数にはその変更は反映されない。

source: If any command line parameters are used, the script is compiled immediately unless /gui is used.
ja: コマンドラインパラメーターが使われた場合、/guiが使われない限り、スクリプトは直ちにコンパイルされる。

source: If any line is indented less than the first line or with the wrong characters, all leading whitespace on that line is left as is.
ja: もし、ある行が最初の行より小さくインデントされたり、間違った文字でインデントされた場合、その行のすべての先頭の空白はそのまま残されます。

source: If any modifiers are specified for the source key (including Shift if the source key is an uppercase letter), they are excluded as described above.
ja: ソースキーに修飾子が指定されている場合（ソースキーが大文字の場合はShiftを含む）、上記のように除外される。

source: If any of a hotkey's subroutines are currently running, the total number of threads is displayed for that hotkey.
ja: ホットキーのサブルーチンのいずれかが現在実行中の場合、そのホットキーのスレッドの合計数が表示されます。

source: If any of a hotkey's variants have a non-zero #InputLevel, the level (or minimum and maximum levels) are displayed.
ja: ホットキーのバリエーションに0以外の#InputLevelがある場合、そのレベル（または最小と最大のレベル）が表示されます。

source: If any of the control flow statements mentioned above has only a single statement, that statement need not be enclosed in a block (this does not work for function definitions).
ja: 上記の制御フロー文のうち、文が1つしかない場合、その文はブロックで囲む必要はありません（関数定義には使えません）。

source: If any of the input parameters to a RegEx function is modified during a callout, the behaviour is undefined.
ja: RegEx関数への入力パラメータのいずれかがコールアウト中に変更された場合、動作は未定義となる。

source: If any of the option letters are omitted and the hotkey already exists, those options will not be changed.
ja: オプション文字が省略され、ホットキーがすでに存在する場合、それらのオプションは変更されません。

source: If any of the values are not integers, they will be considered zero when sorting (unless they start with a number, in which case that number is used).
ja: 値のいずれかが整数でない場合、ソート時にゼロとみなされます（ただし、数値で始まる場合は、その数値が使用されます）。

source: If any one of the accessor functions is omitted, behavior is inherited from a base object.
ja: アクセサー関数を省略した場合、動作はベースオブジェクトから継承されます。

source: If any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply and the section as a whole is intended to apply in other circumstances.
ja: 本節の一部が特定の状況下で無効または執行不能とされた場合、本節の残りの部分が適用され、本節全体が他の状況下で適用されることが意図されている。

source: If applied to the last column, it will be made at least as wide as all the remaining space in the ListView.
ja: 最後のカラムに適用すると、ListViewの残りのスペースと同じ幅になるようにします。

source: If assigning the new base would change the native type of the object, an exception is thrown.
ja: 新しいベースを割り当てると、オブジェクトのネイティブタイプが変更される場合は、例外がスローされます。

source: If at least one variant of a keyboard hotkey has the tilde modifier, that hotkey always uses the keyboard hook.
ja: キーボードホットキーの少なくとも1つのバリエーションがチルダ修飾子を持つ場合、そのホットキーは常にキーボードフックを使用します。

source: If between/is/in/contains (but see isXXX)
ja: If between/is/in/contains（ただし、isXXXを参照）

source: If blank or omitted (or when using 2-parameter mode), it defaults to 0.
ja: 空白または省略したとき、または2パラメータモードのときの初期値は0になります。

source: If blank or omitted, Needle will be replaced with blank (empty), meaning it will be omitted from the return value.
ja: 空白または省略したときは、Needleは空白（空）に置き換えられ、戻り値から省略されます。

source: If blank or omitted, NeedleRegEx will be replaced with blank (empty), meaning it will be omitted from the return value.
ja: 空白または省略したときは、NeedleRegExは空白（空）に置き換えられ、戻り値から省略されます。

source: If blank or omitted, all the text in the ListView is retrieved.
ja: 空白または省略された場合は、ListView 内の全てのテキストが取得されます。

source: If blank or omitted, it defaults to 0 (false).
ja: 空白または省略された場合、デフォルトは 0 (false)です。

source: If blank or omitted, it defaults to 0.
ja: 空白または省略された場合、デフォルトは 0 です。

source: If blank or omitted, it defaults to On.
ja: 空白または省略された場合、デフォルトでOnになります。

source: If blank or omitted, it defaults to ShortDate.
ja: 空白または省略された場合、デフォルトでShortDateになります。

source: If blank or omitted, it defaults to B. Otherwise, specify one of the following letters to cause the result to be returned in specific units:
ja: 空白または省略されたとき、初期値はBです。そうでないときに結果を特定の単位で返すようにするには、以下の文字のいずれかを指定します：

source: If blank or omitted, it defaults to M (modification time).
ja: 空白または省略された場合、デフォルトはM（修正時間）です。

source: If blank or omitted, it defaults to M. Otherwise, specify one of the following letters to set which timestamp should be retrieved:
ja: 空白または省略されたとき、初期値はMです。そうでないときは、次の文字を指定して取得するタイムスタンプを設定します：

source: If blank or omitted, it defaults to no string.
ja: 空白または省略したときの初期値は文字列なしになります。

source: If blank or omitted, it defaults to no text.
ja: 空白または省略したときの初期値はテキストなしになります。

source: If blank or omitted, it defaults to the current local date and time.
ja: 空白または省略された場合、現在のローカルタイムがデフォルトとなります。

source: If blank or omitted, it defaults to the current time.
ja: 空白または省略された場合、現在の時刻がデフォルトとなる。

source: If blank or omitted, it defaults to the master mute setting.
ja: 空白または省略したときは、デフォルトでマスターミュート設定になります。

source: If blank or omitted, it defaults to the master volume setting.
ja: 空白または省略したときは、マスター音量を設定します。

source: If blank or omitted, it defaults to the system's default device for playback (which is not necessarily device 1).
ja: 空白または省略したときは、初期値はシステムのデフォルトの再生デバイス（必ずしもデバイス1である必要はありません）になります。

source: If blank or omitted, it defaults to the time followed by the long date, both of which will be formatted according to the current user's locale.
ja: 省略されたときは、デフォルトで時刻の後に長い形式の日付が続き、両方とも現在のユーザーのロケールに従ってフォーマットされます。

source: If blank or omitted, it defaults to zero, which is the same as having none of the options below.
ja: 省略したときは、初期設定は0となります。次のオプションが何も設定されないのと同じです。

source: If blank or omitted, only files are included and subdirectories are not recursed into.
ja: 空白または省略された場合、ファイルのみが含まれ、サブディレクトリは再帰されません。

source: If blank or omitted, only files are operated upon and subdirectories are not recursed into.
ja: 空白または省略された場合、ファイルのみが操作され、サブディレクトリは再帰されません。

source: If blank or omitted, only values are included and subkeys are not recursed into.
ja: 空白または省略された場合、値のみが含まれ、サブキーは再帰されません。

source: If blank or omitted, the AlwaysOn/Off attribute of the key is removed (if present).
ja: 属性空白または省略したときは、AlwaysOn/Off属性（存在する場合）を削除します。

source: If blank or omitted, the X and Y coordinates will be used for absolute positioning.
ja: 空白または省略されたときは、X、Y座標は絶対座標になります。

source: If blank or omitted, the control is made blank.
ja: 空白または省略されたときは、コントロールを空白にします。

source: If blank or omitted, the delay is applied to the traditional SendEvent mode.
ja: 空白または省略したときは、遅延は従来のSendEventモードに適用されます。

source: If blank or omitted, the dialog's initial selection will be the user's My Documents folder (or possibly My Computer).
ja: 空白または省略された場合、ダイアログの初期選択は、ユーザーのマイ ドキュメントフォルダ（またはマイコンピュータ）になります。

source: If blank or omitted, the function activates the oldest non-member window.
ja: 空白または省略されたとき、この関数はグループのメンバーではない最も古いウィンドウをアクティブにします。

source: If blank or omitted, the function activates the oldest window in the series.
ja: 空白または省略すると、この関数は最も古いウィンドウをアクティブにします。

source: If blank or omitted, the function closes the active window and activates the oldest window in the series.
ja: 空白または省略したときは、アクティブウィンドウを閉じて、グループの中で最も古いウィンドウをアクティブにします。

source: If blank or omitted, the input box will be centered horizontally and vertically on the screen, with a default size of about 380x200 pixels, depending on the OS version and theme.
ja: 空白または省略したときは、インプットボックスは画面の水平方向と垂直方向の中央に配置され、OSのバージョンとテーマによって異なりますが、デフォルトのサイズは約380x200ピクセルです。

source: If blank or omitted, the key's default value will be deleted (except as noted above), which is the value displayed as "(Default)" by RegEdit.
ja: 空白または省略されたときは、上記の場合を除いてキーのデフォルト値は削除されます。これはRegEditで「(既定)」として表示される値です。

source: If blank or omitted, the key's default value will be deleted (except as noted above).
ja: 空白または省略された場合、キーのデフォルト値が削除されます（上記を除く）。

source: If blank or omitted, the key's default value will be retrieved (except as noted above).
ja: 空白または省略された場合、キーのデフォルト値が取得される（ただし、上記の場合を除く）。

source: If blank or omitted, the key's default value will be used (except as noted above).
ja: 空白または省略された場合、キーのデフォルト値が使用されます（上記を除く）。

source: If blank or omitted, the name of the device itself will be retrieved.
ja: 空白または省略したときは、デバイス名そのものを取得します。

source: If blank or omitted, the pixel is retrieved using the normal method.
ja: 空白または省略したときは、通常の方法でピクセルを取得します。

source: If blank or omitted, the script's own process is used.
ja: 空白または省略された場合、スクリプト自身のプロセスが使用されます。

source: If blank or omitted, the shortcut will have a blank "Start in" field and the system will provide a default working directory when the shortcut is launched.
ja: 空白または省略された場合、ショートカットの "Start in" フィールドは空白となり、ショートカットの起動時にシステムがデフォルトの作業ディレクトリを提供することになります。

source: If blank or omitted, the window is restored to its original/default display area.
ja: 空白または省略された場合、ウィンドウは元の/デフォルトの表示領域に戻される。

source: If blank, masking is disabled.
ja: 空白の時は、マスクは無効になります。

source: If blank, the script's name is used instead.
ja: 空白の場合は、スクリプト名が代わりに使用される。

source: If both 0 and - appear, the 0 is ignored.
ja: 0と -の両方が表示される場合、0は無視されます。

source: If both Base and Exponent are 0, the result is undefined and an exception is thrown.
ja: 基数と指数の両方が0の場合、結果は未定義となり例外がスローされる。

source: If both base and exponent are 0, the result is undefined and an exception is thrown.
ja: 基数と 指数の両方が0の場合、結果は未定義となり例外がスローされる。

source: If both X and Y are omitted, the control will be positioned beneath the previous control using a standard padding distance (the current margin).
ja: Xと Yの両方が省略された場合、コントロールは標準的なパディング距離（現在のマージン）を使用して前のコントロールの下に配置されます。

source: If both F and D are omitted, files are included but not folders.
ja: FとDの両方が省略された場合、ファイルは含まれるがフォルダーは含まれません。

source: If both Unicode (W) and ANSI (A) versions of the function are available, omit the W or A suffix and use the "Str" type for input parameters or the return value.
ja: Unicode（W）版とANSI（A）版の両方が利用可能な場合、WまたはAの接尾辞を省略し、入力パラメータまたは戻り値に「Str」型を使用します。

source: If both X and Y are omitted, the menu is displayed at the current position of the mouse cursor.
ja: XとYの両方を省略した場合は、マウスカーソルの現在位置にメニューが表示されます。

source: If both are omitted, the default is 0.0 to 1.0.
ja: 両方とも省略されたときの初期値は、0.0～1.0です。

source: If both are omitted, the image's original size is used.
ja: 両方が省略された場合、画像のオリジナルサイズが使用されます。

source: If both parameters are omitted, the return value is a floating-point number between 0.0 (inclusive) and 1.0 (generally exclusive), instead of an integer between 0 and 2147483647 (inclusive).
ja: 両パラメータを省略した場合、戻り値は0～2147483647の整数ではなく、0.0（包含）～1.0（概ね排他）の浮動小数点数です。

source: If both parameters are omitted, this method has no effect.
ja: 両方のパラメータが省略された場合、このメソッドは何の効果もない。

source: If both the D and U options are absent, a complete click (down and up) will be sent.
ja: Dと Uの両方のオプションがない場合、完全なクリック（下と上）が送信されます。

source: If both the H and R options are absent, DropDownLists, ComboBoxes, ListBoxes, and empty multi-line Edit controls default to 3 rows; GroupBoxes default to 2 rows; vertical Sliders and Progress Bars default to 5 rows; horizontal Sliders default to 30 pixels (except if a thickness has been specified); horizontal Progress Bars default to 2 times the current font size; Hotkey controls default to 1 row; and Tab controls default to 10 rows.
ja: Hと Rの両方のオプションがない場合、DropDownList、ComboBox、ListBox、空の複数行編集コントロールのデフォルトは3行、GroupBoxのデフォルトは2行、垂直スライダーとプログレスバーのデフォルトは5行、水平スライダーのデフォルトは30ピクセル（太さが指定されている場合は除く）、水平プログレッサーは現在のフォントサイズの2倍、ホットキーコントロールは1行、タブコントロールは10行になります。

source: If both the R and H options are present, R will take precedence.
ja: Rと Hの両方のオプションがある場合、Rが優先されます。

source: If both these options are omitted, icons loaded from ICO, DLL, or EXE files are scaled to the system's default small-icon size, which is usually 16 by 16 (you can force the actual/internal size to be used by specifying *w0 *h0).
ja: これらのオプションが省略された場合、ICO、DLL、EXEファイルから読み込まれたアイコンは、通常16×16のシステムのデフォルトのスモールアイコンサイズにスケーリングされます（*w0 *h0を指定すると、実際の/内部のサイズを強制的に使用することができます）。

source: If calibration is needed, use the operating system's control panel or the software that came with your controller.
ja: キャリブレーションが必要な場合は、オペレーティングシステムのコントロールパネルまたはコントローラに付属のソフトウェアを使用してください。

source: If combined in any other case (or if any other invalid suffix is present), the key is not recognized.
ja: それ以外のとき、または他の無効な接尾辞があるときは、キーは認識されません。

source: If conversion between code pages is necessary, the length of the return value may differ from the length of the source string.
ja: コード・ページ間の変換が必要な場合、戻り値の長さがソース文字列の長さと異なることがある。

source: If data has been written into the object's internal buffer, it is committed to disk before the handle is returned.
ja: データがオブジェクトの内部バッファに書き込まれている場合、ハンドルが返される前にディスクにコミットされます。

source: If defined, it must perform the default action; e.g. if __set does not store the value, it is not stored.
ja: 定義されている場合、デフォルトの動作を行わなければならりません。例えば、__setが値を保存しない場合、その値は保存されることはありません。

source: If distribution of executable or object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place counts as distribution of the source code, even though third parties are not compelled to copy the source along with the object code.
ja: 実行可能コードやオブジェクトコードの頒布が、指定された場所からコピーするためのアクセスを提供することによって行われる場合、同じ場所からソースコードをコピーするための同等のアクセスを提供することは、第三者がオブジェクトコードとともにソースをコピーすることを強制されなくても、ソースコードの頒布としてカウントされます。

source: If each of these is blank or omitted, all windows on the entire system will be counted.
ja: パラメータが空白、または省略されたときは、システム上の全てのウィンドウの数が対象になります。

source: If each of these is blank or omitted, all windows on the entire system will be retrieved.
ja: それぞれを空白または省略すると、システム全体のすべてのウィンドウが検索されます。

source: If each of these is blank or omitted, the Last Found Window will be used.
ja: もしこれらの項目が未設定または省略されたときは、最後に見つかったウィンドウが使用されます。

source: If each of these is unset or omitted, the Last Found Window will be used.
ja: これらの各項目が未設定または省略された場合、最後に見つかったウィンドウが使用される。

source: If either A or B is a floating point number or both are omitted, the result will be a floating point number.
ja: AまたはBのいずれかが浮動小数点数であるか、または両方が省略されたときに、戻り値は浮動小数点数になります。

source: If either X or Y is omitted, the corresponding values will not be stored.
ja: XまたはYのいずれかが省略された場合、対応する値は格納されない。

source: If either coordinate is omitted, Control's position in that dimension will not be changed.
ja: どちらかの座標が省略された場合、その次元におけるコントロールの位置は変更されません。
